// プログラミング言語:C++
// コンパイル方法:g++ -std=c++17 22_12485-03-03.cpp
// 実行方法:コンパイルで生成したa.outというファイルを実行
// (Ubuntu 20.04.06 LTSで"./a.out"で実行できることを確認した)

/*
03-03 (b)
hat_c=0110011111111101110000100011110110000111011111100011100111110111111001010010100101100110100000100100100001111110111100111101101001010101001010110000100011001010100111100011111101101011010001011111111001010000011001110000111111100101010111100110001011000010010001111011101101011011001111001101010111110110010110111000110101010100101001110111100100100110011101000001000101111101000000011101010101010111011101110100011010101100000111100111001010111011100000100000000011110010101010100111100010111011111001010101010111010100101000100010011000100010100001010110001111111000000011011011101100011110010111000101010001000010111011001011000101110100101111111101110100111100111100011000010100000000111101100110110111101110110010100101001111111110110001101101110110011110000010001000001100011101010011100110000101100110101111010011111001100000011000011010000011110000100111100101000101000110001100001100001000000000001101010100101000011001000011111001110101001001000011011001111111101101000001101010011100001000100011101100100100111100
i_MD=56
*/

#include <iostream>
#include <string>
#include <vector>
#include <cmath>
#include <iomanip>
#include <map>
#include <queue>
#include <bitset>
#include <algorithm>
using namespace std;

int main(void){
    int n = 0; // 符号長
    int m = 0; // 符号の要素数
    int d = 0; // 最小距離
    int i_MD = 0; // 出力する添え字
    int cnt = 0; // ハミング距離を調べるカウンタ変数
    string r = ""; // 受信語 
    string c_hat = ""; // 推定符号語

    /*符号長、要素数の受け取り*/
    cout << "n=";
    cin >> n;
    cout << "M=";
    cin >> m;

    d = n; // 最小距離はより小さいものがあるたびに更新していくので初期値は最大値であるnにしておく

    vector<string> c(m); // 符号を保持する配列

    /*符号の入力*/
    cout << "C=" << endl;
    for(int i=0;i<m;i++){
        cin >> c.at(i);
    }

    /*受信語の入力*/
    cout << "r=" << endl;
    cin >> r;

    /*
    受信語と各符号のハミング距離を調査
    これまでの最小のハミング距離よりも小さいハミング距離が現れたらその符号を仮の複号語とする
    同時に添え字とそのときのハミング距離も保存
    これを全て調べつくすまで繰り返す、最終的に保存されているものが複合結果
    */
    for(int i=0;i<m;i++){
        cnt = 0;
        for(int j=0;j<n;j++){
            if(c.at(i).at(j) != r.at(j)) cnt++;
        }
        if(d>cnt){
            d = cnt;
            i_MD = i;
            c_hat = c.at(i);
        }
    }

    /*結果の出力*/
    cout << endl;
    cout << "OUTPUT:" << endl;
    cout << "hat_c=" << c_hat << endl;
    cout << "i_MD=" << i_MD << endl;

    return 0;
}